<?php

// +----------------------------------------------------------------------
// | 配置名称：菜单常量定义
// +----------------------------------------------------------------------
// | 配置功能：定义系统中菜单相关的常量值
// | 主要配置：首页PID、模块名前缀等关键常量
// | 当前配置：HOME_PID - 首页标识，MODULE_PREFIX - 模块前缀
// +----------------------------------------------------------------------

namespace app\common\constants;

/**
 * 菜单常量
 * Class MenuConstant
 * @package app\common\constants
 */
class MenuConstant
{

    /**
     * 首页的PID
     */
    const HOME_PID = 99999999;

    /**
     * 模块名前缀
     */
    const MODULE_PREFIX = 'easyadmin_';

}