<?php
// +----------------------------------------------------------------------
// | 后台管理系统配置文件
// +----------------------------------------------------------------------
// | 该配置文件定义了后台管理系统的权限验证规则，包括：
// | - 无需登录验证的控制器列表
// | - 无需登录验证的节点列表
// | - 无需权限验证的控制器列表
// | - 无需权限验证的节点列表
// +----------------------------------------------------------------------

return [

    // 不需要验证登录的控制器
    'no_login_controller' => [
        'login',
    ],

    // 不需要验证登录的节点
    'no_login_node'       => [
        'login/index',
        'login/out',
        'hezi/url',
        'system.config/autoSave'
    ],

    // 不需要验证权限的控制器
    'no_auth_controller'  => [
        'ajax',
        'login',
        'index',
    ],

    // 不需要验证权限的节点
    'no_auth_node'        => [
        'login/index',
        'login/out',
        'hezi/url',
        'system.config/autoSave'
    ],
];