<?php
// +----------------------------------------------------------------------
// | 路由配置文件
// +----------------------------------------------------------------------
// | 该配置文件用于定义后台应用的路由规则和中间件
// | 包含路由中间件的注册和配置
// | 控制请求的处理流程和权限验证
// +----------------------------------------------------------------------

return [

    // 路由中间件
    'middleware' => [

        // 后台视图初始化
        \app\admin\middleware\ViewInit::class,

        // 检测用户是否登录
        \app\admin\middleware\CheckAdmin::class,


    ],
];
